/*******************************************************************************
  Copyright (C), 2015, 712.Co.,Ltd.
  FileName: MsgManager.c
  Author: lq       Version : V1.0.0        Date: 2015.06.23
  Description:     消息管理模块
  Version:         V1.0.0
  Function List:   // 主要函数及其功能
  			
  History:         // 历史修改记录
      <author>  <time>   <version >   <desc>
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "Include.h"

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Public variables ----------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/
/*******************************************************************************
* 名称  : AisMain
* 描述  : AIS协议栈主函数
* 输入  : 无
* 输出  : 无
* 返回  : 无
*******************************************************************************/
void AisMain(void)
{
    /*lq 更新动态信息 */
    UpdateAisDynamicInfo();

    /*lq 更新动态消息报告间隔 */
    UpdateDynamicReportInterval();

    /*lq 接收数据帧检测 */
    DLS_InstPacketProbeProcess();

    /*lq 消息接收管理 */
    MSGMAN_MsgRxProcess();

    /*lq 消息发送管理 */
    MSGMAN_MsgTxProcess();

    /*lq 收发消息数据转移 */
    LME_BinMsgPort();

    /*lq 收发消息串口输出 */
    AISDI_SentencePrint();
    
    /*lq 消息发射控制 */
    TRCTRL_TransmitProcess();               
}

/*==============================================================================
------------------------------------End of File---------------------------------
==============================================================================*/
