/*******************************************************************************
  Copyright (C), 2011, 712.Co.,Ltd.
  FileName: math_rand.c
  Author: lq       Version : V1.00        Date: 2013.11.04
  Description:     随机数生成模块的变量、函数定义
                   随机算法
                    使用方法如下:
                    1.引用#include "math_rand.h"
                    2.使用MATH_RAND(variable_name)定义一个随机算法的实例
                    3.调用SetRandSeed(&variable_name, seed)设置随机算法种子
                    4.调用RandData(&variable_name, min, max)获得随机数
  Version:         V1.00
  Function List:   // 主要函数及其功能
  			
  History:         // 历史修改记录
      <author>  <time>   <version >   <desc>
*******************************************************************************/

#include "math_rand.h"

/***************************************************************************/
/*								静态全局变量							   */
/***************************************************************************/

/***************************************************************************/
/*								内部函数声明							   */
/***************************************************************************/

/***************************************************************************/
/*								导出全局变量							   */
/***************************************************************************/

/***************************************************************************/
/*								导入全局变量							   */
/***************************************************************************/


/************************************************************************
函数名：RandData
功能：产生任意区间内均匀分布的一个随机整数
输入：随机数所在区间 min,max,指向随机数种子，应为大于零的奇数 int *r
输出：返回一个在区间[min,max]内的随机整数
返回值：返回一个在区间[min,max]内的随机整数
备注：有取余运算，算法的实现效率还待改进，算法正确性已验证；               */
/************************************************************************/
U16 RandData(struct math_rand* _rand, U16 min, U16 max)
{
	U32 k,n,m,i,p;

	k = max - min + 1; 
	n = 2;

	while (n < k) 
	{
		n = n + n;
	}

	m = n << 2;	// m=4*n
	k = _rand->seed; 
	i = 1;

	while (i <= 1)
	{
		k = k + k + k + k + k;
		k = k % m;
		n = k / 4 + min;
		if (n <= max)
		{
			p = n;
			i = i + 1;
		}
		else
		{
		}
	}

	_rand->seed = k;


	return p;
}


/*设置随机数种子*/
void SetRandSeed(struct math_rand* _rand, U32 seed)
{
	_rand->seed = seed*2 + 1;	/*种子必须是奇数*/

#if 0
	/*数值保护:到底保护多少,去问zz*/
	if (_rand->seed > 60000)
	{
		/*修改种子为随机值*/
		_rand->seed = RandData(_rand, 10, 60000);
	}

#endif
}
